{
    "scene1": {
        "title": "ظلمات الجاهلية",
        "year": "قبل الهجرة بنحو 200 عام",
        "paragraph": "كانت الجزيرة العربية تغرق في ظلام دامس، رغم ما حباها الله من موقع استراتيجي وثروات. السيف هو الحَكَم الأول والأخير، والقبيلة هي الهوية الوحيدة التي يعرفها الإنسان. الحق يُقاس بقوة الذراع لا بميزان العدل، والكرامة الإنسانية مفهوم غائب عن قاموس الحياة. المرأة سلعة تُباع وتُشترى، واليتيم فريسة سهلة لمن لا ضمير له، والعبد أداة لا روح فيها. الخمر تسيل في الأسواق كالماء، والميسر يُدمّر البيوت ويُشعل الحروب بين الإخوة. كان الرجل يدفن ابنته حية خوفًا من العار أو الفقر، فلا يرتجف له جفن ولا يهتز له قلب. الأصنام المنحوتة من الحجر والخشب تملأ أرجاء الكعبة—البيت الذي بناه إبراهيم عليه السلام لعبادة الله الواحد—حتى بلغ عددها ثلاثمائة وستين صنمًا. كانت القلوب قاسية كالصخر، والنفوس تائهة تبحث عن معنى وسط فوضى الجهل والظلم. لكن الله سبحانه وتعالى كان يُعِدّ الأرض لنور عظيم سيُبدّد كل هذا الظلام.",
        "fact": "من أبشع صور الجاهلية قصة قيس بن عاصم التميمي، الذي دفن اثنتي عشرة ابنة له وهن أحياء. يُروى أنه كان جالسًا يومًا مع قومه حين جاءته ابنته الصغيرة تجري إليه فرحة، فنفضت التراب على لحيته وهي تلعب. ضحك القوم منه، فأخذته الحمية والكبرياء، فقام بها إلى الصحراء وحفر لها حفرة ودفنها حية وهي تنظر إليه وتستغيث. بعد إسلامه بكى قيس بكاءً شديدًا وهو يتذكر ما فعل، وقال للنبي ﷺ: 'يا رسول الله، إني وأدت في الجاهلية ثنتي عشرة ابنة'، فقال له النبي ﷺ: 'إن الله قد وضع عنك ما كان في الجاهلية'. هذه القصة تُظهر كيف كان الجهل يُعمي البصائر ويقتل الفطرة الإنسانية، وكيف جاء الإسلام ليُحيي القلوب الميتة."
    },
    "scene2": {
        "title": "تيه الأرواح",
        "year": "قبل الهجرة بنحو 150 عام",
        "paragraph": "في زمن الجاهلية، كانت العقيدة خليطًا مشوهًا من الوثنية والخرافات. ورث الناس عبادة الأصنام عن آبائهم دون تفكير أو تدبر، فصارت الأحجار الصماء معبودات تُقدَّم لها القرابين وتُطلب منها الحاجات. كل قبيلة لها صنمها الخاص: اللات والعزى ومناة وهُبَل، أسماء حفرتها الأجيال في ذاكرتها دون أن تسأل: هل تنفع أو تضر؟ هل تسمع أو تُبصر؟ كانت الكعبة المشرفة—التي بناها إبراهيم وإسماعيل عليهما السلام لعبادة الله وحده—قد امتلأت بالأصنام حتى ضاق بها المكان. الناس يطوفون حولها عراة، ويصفقون ويصفرون، ويخلطون بين الحق والباطل في طقوس موروثة لا معنى لها. لكن وسط هذا الظلام الحالك، كانت هناك قلة قليلة من 'الحنفاء'—رجال رفضوا عبادة الأصنام وبقوا على فطرة التوحيد. كانوا يعتزلون قومهم، يبحثون عن الحقيقة في صمت، ينتظرون نبيًا يعلمون من الكتب القديمة أن زمانه قد اقترب. كان الله عز وجل يُهيئ الأرض لرسالة ستُعيد الإنسان إلى فطرته، وتُخرجه من عبادة العباد إلى عبادة رب العباد.",
        "fact": "من أشهر الحنفاء زيد بن عمرو بن نفيل، عم عمر بن الخطاب رضي الله عنه. كان زيد يرفض عبادة الأصنام ويقول لقومه: 'أتعبدون ما لا يسمع ولا يبصر؟' وكان يبحث عن دين إبراهيم عليه السلام. خرج زيد يطوف البلاد باحثًا عن الحق، فذهب إلى الشام والعراق يسأل الأحبار والرهبان. التقى براهب في الشام فقال له: 'إن الذي تطلبه قد أظل زمانه، وسيخرج من بلدك'. رجع زيد إلى مكة وأسند ظهره إلى الكعبة وقال: 'اللهم لو أعلم أحب الوجوه إليك لعبدتك به، ولكني لا أعلم'. ومات زيد قبل البعثة بخمس سنوات. لما بُعث النبي ﷺ قال عنه: 'يُبعث زيد بن عمرو أمة وحده يوم القيامة'. هذه القصة تُظهر أن الفطرة السليمة كانت تبحث عن الحق حتى في أحلك الأوقات، وأن الله لا يضيع من يبحث عنه بصدق."
    },
    "scene3": {
        "title": "عام الفيل والمولد المبارك",
        "year": "قبل الهجرة بـ 53 سنة",
        "paragraph": "في ذلك العام الذي سُمي بعام الفيل، شهدت مكة حدثًا عظيمًا هزّ الجزيرة العربية كلها. جاء أبرهة الحبشي بجيش جرار يقوده فيل ضخم، يريد هدم الكعبة ليُجبر العرب على الحج إلى كنيسته في اليمن. وقف عبد المطلب جد النبي ﷺ أمام أبرهة بكل شموخ وقال كلمته الخالدة: 'للبيت رب يحميه'. وتركت قريش مكة وصعدت إلى الجبال تنتظر ما سيحدث. وحين اقترب الجيش من الكعبة، وقف الفيل ورفض التقدم رغم كل محاولات الجنود. ثم أرسل الله عليهم طيرًا أبابيل تحمل حجارة من سجيل، فجعلتهم كعصف مأكول. هلك الجيش، ونجت الكعبة، وعلم الناس أن لهذا البيت شأنًا عظيمًا عند الله. وفي هذا العام نفسه، ولد محمد بن عبد الله ﷺ في فجر يوم الاثنين من شهر ربيع الأول. جاء إلى الدنيا يتيمًا—فقد مات أبوه عبد الله قبل ولادته—لكن الله كان يُعده لمهمة عظيمة. يقول الله تعالى: {أَلَمْ يَجِدْكَ يَتِيمًا فَآوَىٰ * وَوَجَدَكَ ضَالًّا فَهَدَىٰ * وَوَجَدَكَ عَائِلًا فَأَغْنَىٰ}. كان مولده ﷺ إيذانًا ببزوغ فجر جديد سيُنير الأرض كلها.",
        "fact": "تروي كتب السيرة أن آمنة بنت وهب، أم النبي ﷺ، قالت: 'لما ولدته خرج مني نور أضاءت له قصور الشام'. وفي ليلة مولده ﷺ، سقطت الأصنام في الكعبة على وجوهها، وخمدت نار فارس التي كانوا يعبدونها منذ ألف عام ولم تنطفئ قبل ذلك، وانشق إيوان كسرى. كانت هذه إشارات كونية تُعلن أن زمن الظلام قد انتهى، وأن نور الحق قد بدأ يشرق على الأرض."
    },
    "scene4": {
        "title": "في شعاب مكة",
        "year": "قبل الهجرة بنحو 45 سنة",
        "paragraph": "رعى محمد ﷺ الغنم في شبابه، وكانت هذه المهنة البسيطة مدرسة ربانية أعدته لحمل الرسالة. في تلك الشعاب الهادئة، تعلم الصبر على الضعيف، والرحمة بالصغير، والحزم عند الحاجة. كان يحمي الغنم من الذئاب، ويبحث عن الشاة الضالة، ويسهر على راحتها. هذه المهنة علّمته أن القيادة مسؤولية لا سلطة، وأن الراعي يخدم رعيته قبل أن يحكمها. يقول النبي ﷺ: 'ما من نبي إلا وقد رعى الغنم'، فقالوا: وأنت يا رسول الله؟ قال: 'وأنا كنت أرعاها لأهل مكة على قراريط'. كان الله يُعده في صمت، يُهذب أخلاقه، ويُنمي في قلبه الرحمة والحكمة.",
        "fact": "الحكمة من رعي الأنبياء للغنم أن الغنم من أضعف المخلوقات وأكثرها احتياجًا للرعاية، فمن يصبر عليها ويرحمها يكون أقدر على رعاية البشر. والغنم تتفرق بسهولة، فيتعلم الراعي كيف يجمعها بالحكمة لا بالقسوة، وهذا ما يحتاجه قائد الأمة."
    },
    "scene5": {
        "title": "الصادق الأمين",
        "year": "قبل الهجرة",
        "paragraph": "قبل أن ينزل عليه الوحي، كان محمد ﷺ مشهورًا بين أهل مكة بالصدق والأمانة. لم يُعرف عنه كذب قط، ولا خيانة، ولا غدر. كان الناس يضعون عنده أموالهم وأماناتهم وهم مطمئنون، حتى أعداؤه كانوا يثقون به. وحين اختلفت قبائل قريش على من يضع الحجر الأسود في مكانه بعد تجديد الكعبة، وكادت تقع حرب بينهم، اتفقوا أن يُحكّموا أول داخل عليهم. فكان أول داخل هو محمد ﷺ، فقالوا: 'هذا الأمين، رضينا'. فحل المشكلة بحكمة: وضع الحجر على ثوب، وطلب من كل قبيلة أن تمسك بطرف منه، ثم رفعه بنفسه ووضعه في مكانه. هذا الموقف يُظهر كيف كان الله يُعده للقيادة، ويجعل الناس يثقون به قبل أن يُكلفه بالرسالة.",
        "fact": "حتى بعد البعثة وأثناء الهجرة، ترك النبي ﷺ عليًا بن أبي طالب رضي الله عنه في مكة ليرد الأمانات إلى أصحابها من المشركين الذين كانوا يحاربونه. هذا يُظهر أن الأمانة عنده ﷺ لم تكن مجرد خُلق، بل كانت عقيدة لا تتغير حتى مع الأعداء."
    },
    "scene6": {
        "title": "خلوة حراء",
        "year": "قبل الهجرة بـ 18 سنة",
        "paragraph": "كان النبي ﷺ يصعد إلى غار حراء في جبل النور، يعتزل الناس ويتعبد الليالي ذوات العدد. كان يتأمل خلق السماوات والأرض، ويتفكر في حال قومه الذين ضلوا الطريق. كان قلبه يبحث عن الحق، وروحه تتوق إلى معرفة الله. في ذلك الغار الصغير، كان الله يُهيئ قلب نبيه لتلقي الوحي. كانت تلك الخلوات تدريبًا روحيًا، وإعدادًا نفسيًا لحمل أعظم رسالة في تاريخ البشرية.",
        "fact": "غار حراء يقع على ارتفاع 634 مترًا، والصعود إليه شاق جدًا حتى اليوم. كان النبي ﷺ يصعد إليه حاملاً طعامه وشرابه، ويمكث فيه أيامًا. هذا يدل على قوة عزيمته ورغبته الشديدة في التعبد والتفكر."
    },
    "scene7": {
        "title": "ليلة القدر",
        "year": "قبل الهجرة بـ 13 سنة",
        "paragraph": "في ليلة من ليالي رمضان، نزل جبريل عليه السلام على محمد ﷺ في غار حراء. قال له: 'اقرأ'، فقال النبي: 'ما أنا بقارئ'. فضمه جبريل حتى بلغ منه الجهد، ثم قال: {اقْرَأْ بِاسْمِ رَبِّكَ الَّذِي خَلَقَ * خَلَقَ الْإِنسَانَ مِنْ عَلَقٍ * اقْرَأْ وَرَبُّكَ الْأَكْرَمُ * الَّذِي عَلَّمَ بِالْقَلَمِ * عَلَّمَ الْإِنسَانَ مَا لَمْ يَعْلَمْ}. كانت هذه أول آيات القرآن الكريم، الكتاب الذي سيُغير مجرى التاريخ. رجع النبي ﷺ إلى بيته يرتجف، فقال لخديجة: 'زملوني زملوني'. فطمأنته وقالت كلماتها الخالدة: 'كلا والله لا يخزيك الله أبدًا، إنك لتصل الرحم، وتحمل الكل، وتكسب المعدوم، وتقري الضيف، وتعين على نوائب الحق'. ثم ذهبت به إلى ورقة بن نوفل، فأخبره أن الذي جاءه هو الناموس الأكبر الذي نزل على موسى، وأنه نبي هذه الأمة. كانت تلك اللحظة بداية النور الذي سيُضيء الأرض كلها.",
        "fact": "يقول الله تعالى: {إِنَّا أَنزَلْنَاهُ فِي لَيْلَةِ الْقَدْرِ * وَمَا أَدْرَاكَ مَا لَيْلَةُ الْقَدْرِ * لَيْلَةُ الْقَدْرِ خَيْرٌ مِّنْ أَلْفِ شَهْرٍ}. في تلك الليلة المباركة، بدأ نزول القرآن، الكتاب الذي لم ولن يُحرّف، المحفوظ بحفظ الله: {إِنَّا نَحْنُ نَزَّلْنَا الذِّكْرَ وَإِنَّا لَهُ لَحَافِظُونَ}."
    },
    "scene8": {
        "title": "الدعوة السرية",
        "year": "قبل الهجرة بـ 12 سنة",
        "paragraph": "بدأت الدعوة سرًا في البيوت، من قلب إلى قلب. كان النبي ﷺ يدعو من يثق بهم: خديجة زوجته، وعلي ابن عمه، وأبو بكر صديقه، وزيد بن حارثة مولاه. ثم بدأ أبو بكر يدعو من يثق بهم، فأسلم عثمان بن عفان، والزبير بن العوام، وعبد الرحمن بن عوف، وسعد بن أبي وقاص، وطلحة بن عبيد الله. كانوا يجتمعون في دار الأرقم بن أبي الأرقم، يتعلمون القرآن، ويصلون خفية. كانت مرحلة بناء القاعدة الإيمانية، تربية الجيل الأول على التوحيد والأخلاق. يقول الله تعالى: {وَاصْبِرْ نَفْسَكَ مَعَ الَّذِينَ يَدْعُونَ رَبَّهُم بِالْغَدَاةِ وَالْعَشِيِّ يُرِيدُونَ وَجْهَهُ}.",
        "fact": "كان من أوائل من أسلم بلال بن رباح، العبد الحبشي. لما علم سيده أمية بن خلف بإسلامه، أخرجه في حر الظهيرة ووضع صخرة ضخمة على صدره وقال: 'لا تزال هكذا حتى تموت أو تكفر بمحمد'. فكان بلال يقول: 'أحد أحد'. مر به أبو بكر فاشتراه وأعتقه. هذا يُظهر أن الإسلام ساوى بين الناس، فالعبد الأسود أصبح من أعظم الصحابة."
    },
    "scene9": {
        "title": "رحلة الإسراء والمعراج",
        "year": "قبل الهجرة بـ 10 سنوات",
        "paragraph": "في ليلة واحدة، أُسري بالنبي ﷺ من المسجد الحرام إلى المسجد الأقصى، ثم عُرج به إلى السماوات السبع. رأى من آيات ربه الكبرى، والتقى بالأنبياء، وصلى بهم إمامًا في المسجد الأقصى. ثم صعد إلى السماء الأولى فرأى آدم، وفي الثانية يحيى وعيسى، وفي الثالثة يوسف، وفي الرابعة إدريس، وفي الخامسة هارون، وفي السادسة موسى، وفي السابعة إبراهيم عليهم السلام جميعًا. ثم رُفع إلى سدرة المنتهى، حيث فُرضت عليه الصلوات الخمس. كانت هذه الرحلة تكريمًا إلهيًا، وتثبيتًا لقلب النبي بعد عام الحزن. يقول الله تعالى: {سُبْحَانَ الَّذِي أَسْرَىٰ بِعَبْدِهِ لَيْلًا مِّنَ الْمَسْجِدِ الْحَرَامِ إِلَى الْمَسْجِدِ الْأَقْصَى الَّذِي بَارَكْنَا حَوْلَهُ لِنُرِيَهُ مِنْ آيَاتِنَا}.",
        "fact": "لما أخبر النبي ﷺ قريشًا بالإسراء والمعراج، كذبوه واستهزؤوا به. فذهب بعضهم إلى أبي بكر وقالوا: 'إن صاحبك يزعم أنه ذهب إلى بيت المقدس ورجع في ليلة واحدة'. فقال أبو بكر: 'إن كان قال ذلك فقد صدق، إني لأصدقه في خبر السماء يأتيه في غدوة أو روحة'. فسُمي الصديق من يومها."
    },
    "scene10": {
        "title": "عام الحزن",
        "year": "قبل الهجرة بـ 3 سنوات",
        "paragraph": "في عام واحد، فقد النبي ﷺ أعز الناس إليه: خديجة زوجته التي آمنت به حين كذبه الناس، وواسته بمالها، وثبتته بحبها. وأبو طالب عمه الذي حماه من قريش طوال سنوات الدعوة. كان عامًا ثقيلًا على قلبه ﷺ، لكنه لم يتوقف عن الدعوة لحظة واحدة. بل ذهب إلى الطائف يدعو ثقيفًا، فردوه أسوأ رد، وأغروا به صبيانهم وسفهاءهم يرمونه بالحجارة حتى أدموا قدميه الشريفتين. فخرج من الطائف حزينًا، ووقف يدعو ربه بدعاء مؤثر: 'اللهم إليك أشكو ضعف قوتي، وقلة حيلتي، وهواني على الناس. أنت رب المستضعفين وأنت ربي، إلى من تكلني؟ إن لم يكن بك غضب علي فلا أبالي'. فأرسل الله إليه ملك الجبال يقول: 'إن شئت أن أطبق عليهم الأخشبين'. فقال النبي ﷺ: 'بل أرجو أن يُخرج الله من أصلابهم من يعبد الله وحده لا يشرك به شيئًا'. هذا هو الرحمة المهداة.",
        "fact": "بعد عام الحزن مباشرة، كانت رحلة الإسراء والمعراج. كأن الله عز وجل أراد أن يُعوّض نبيه عن حزنه في الأرض بتكريم في السماء. هذا يُعلمنا أن بعد كل ضيق فرجًا، وأن الله لا ينسى عباده الصابرين."
    },
    "scene11": {
        "title": "الاضطهاد والثبات",
        "year": "قبل الهجرة",
        "paragraph": "اشتد أذى قريش على المسلمين. عُذب بلال، وسُمية، وياسر، وعمار، وخباب بن الأرت، وغيرهم كثير. كانوا يُجلدون في الشمس، ويُلقون على الرمال المحرقة، ويُعذبون بأبشع أنواع العذاب. استُشهدت سمية بنت خياط، أول شهيدة في الإسلام، حين طعنها أبو جهل بحربة في قُبلها. ومات زوجها ياسر تحت التعذيب. ومر النبي ﷺ بهم وهم يُعذبون فقال: 'صبرًا آل ياسر، فإن موعدكم الجنة'. فرضت قريش حصارًا اقتصاديًا على بني هاشم وبني المطلب في شعب أبي طالب، فمنعوا عنهم الطعام والشراب والتجارة ثلاث سنوات، حتى أكلوا أوراق الشجر، وكان يُسمع بكاء الأطفال من الجوع. ومع كل هذا الأذى، لم يرتد أحد من المسلمين، بل ازدادوا إيمانًا وتسليمًا. يقول الله تعالى: {أَمْ حَسِبْتُمْ أَن تَدْخُلُوا الْجَنَّةَ وَلَمَّا يَأْتِكُم مَّثَلُ الَّذِينَ خَلَوْا مِن قَبْلِكُم ۖ مَّسَّتْهُمُ الْبَأْسَاءُ وَالضَّرَّاءُ وَزُلْزِلُوا}.",
        "fact": "خباب بن الأرت كان حدادًا، فكان سيده يُحمي الحديد في النار ثم يضعه على ظهره العاري ليرتد عن الإسلام. فكان خباب يصبر ولا يتراجع. بعد سنوات، جاء خباب إلى النبي ﷺ يشكو إليه، فقال له النبي: 'قد كان من قبلكم يُؤتى بالرجل فيُحفر له في الأرض فيُجعل فيها، ثم يُؤتى بالمنشار فيُوضع على رأسه فيُشق باثنين، ما يصده ذلك عن دينه'. ثم قال: 'والله ليُتمن الله هذا الأمر حتى يسير الراكب من صنعاء إلى حضرموت لا يخاف إلا الله'. وقد تحقق ذلك."
    },
    "scene12": {
        "title": "الجهر بالحق",
        "year": "قبل الهجرة بـ 10 سنوات",
        "paragraph": "بعد ثلاث سنوات من الدعوة السرية، أمر الله نبيه بالجهر: {فَاصْدَعْ بِمَا تُؤْمَرُ وَأَعْرِضْ عَنِ الْمُشْرِكِينَ}. فصعد النبي ﷺ على جبل الصفا ونادى: 'يا صباحاه'. فاجتمعت قريش، فقال لهم: 'أرأيتم إن أخبرتكم أن خيلًا بالوادي تريد أن تغير عليكم، أكنتم مصدقي؟' قالوا: 'ما جربنا عليك كذبًا'. قال: 'فإني نذير لكم بين يدي عذاب شديد'. فقال أبو لهب: 'تبًا لك، ألهذا جمعتنا؟' فنزلت سورة المسد: {تَبَّتْ يَدَا أَبِي لَهَبٍ وَتَبَّ}. منذ ذلك اليوم، اشتد العداء، وبدأت قريش تخطط لقتله. لكن الله كان يحفظه، كما قال: {وَاللَّهُ يَعْصِمُكَ مِنَ النَّاسِ}.",
        "fact": "اجتمع كبار قريش في دار الندوة ليتآمروا على قتل النبي ﷺ. فاقترح أبو جهل أن يأخذوا من كل قبيلة شابًا قويًا، ويضربوه ضربة رجل واحد، فيتفرق دمه في القبائل فلا تستطيع بنو هاشم أن تطالب بالقصاص. فأنزل الله على نبيه: {وَإِذْ يَمْكُرُ بِكَ الَّذِينَ كَفَرُوا لِيُثْبِتُوكَ أَوْ يَقْتُلُوكَ أَوْ يُخْرِجُوكَ ۚ وَيَمْكُرُونَ وَيَمْكُرُ اللَّهُ ۖ وَاللَّهُ خَيْرُ الْمَاكِرِينَ}. فأذن الله له بالهجرة."
    },
    "scene13": {
        "title": "الهجرة النبوية",
        "year": "عام الهجرة",
        "paragraph": "خرج النبي ﷺ من مكة ليلًا مع أبي بكر الصديق، تاركًا المدينة التي وُلد فيها وأحبها. وقف على مشارف مكة والتفت إليها وقال: 'والله إنك لأحب بلاد الله إلي، ولولا أن أهلك أخرجوني منك ما خرجت'. اختبأ في غار ثور ثلاثة أيام، وقريش تبحث عنه في كل مكان، وقد جعلت مئة ناقة لمن يأتي به. وصل المشركون إلى باب الغار، فقال أبو بكر: 'يا رسول الله، لو نظر أحدهم تحت قدميه لرآنا'. فقال النبي بكل ثقة: 'يا أبا بكر، ما ظنك باثنين الله ثالثهما؟ لا تحزن إن الله معنا'. فأنزل الله: {إِلَّا تَنصُرُوهُ فَقَدْ نَصَرَهُ اللَّهُ إِذْ أَخْرَجَهُ الَّذِينَ كَفَرُوا ثَانِيَ اثْنَيْنِ إِذْ هُمَا فِي الْغَارِ إِذْ يَقُولُ لِصَاحِبِهِ لَا تَحْزَنْ إِنَّ اللَّهَ مَعَنَا}. وصل إلى المدينة، فاستقبله الأنصار بالأناشيد: 'طلع البدر علينا من ثنيات الوداع'. كانت الهجرة نقطة تحول، من الضعف إلى القوة، ومن الاضطهاد إلى بناء الدولة.",
        "fact": "في ليلة الهجرة، نام علي بن أبي طالب في فراش النبي ﷺ ليُوهم المشركين أن النبي لا يزال في بيته. وقف الشباب المسلحون على باب البيت ينتظرون الفجر ليقتلوه، فخرج النبي من بينهم وهو يقرأ: {وَجَعَلْنَا مِن بَيْنِ أَيْدِيهِمْ سَدًّا وَمِنْ خَلْفِهِمْ سَدًّا فَأَغْشَيْنَاهُمْ فَهُمْ لَا يُبْصِرُونَ}. فلم يره أحد منهم. هذه معجزة حسية تُظهر حفظ الله لنبيه."
    },
    "scene14": {
        "title": "الغزوات والجهاد",
        "year": "2–8 هـ",
        "paragraph": "بعد الهجرة، بدأت قريش تُخطط لاستئصال المسلمين. فكانت غزوة بدر، حيث خرج المسلمون بثلاثمائة وبضعة عشر رجلًا، وقريش بألف مقاتل. لكن الله نصر المؤمنين: {وَلَقَدْ نَصَرَكُمُ اللَّهُ بِبَدْرٍ وَأَنتُمْ أَذِلَّةٌ}. ثم كانت أحد، حيث ابتُلي المسلمون بسبب مخالفة أمر النبي، فأنزل الله: {وَلَا تَهِنُوا وَلَا تَحْزَنُوا وَأَنتُمُ الْأَعْلَوْنَ إِن كُنتُم مُّؤْمِنِينَ}. ثم الأحزاب، حين تحالفت قبائل العرب لمحاصرة المدينة، فحفر المسلمون الخندق، ونصرهم الله بريح عاصفة. ثم فتح مكة، حيث دخل النبي ﷺ منتصرًا متواضعًا، يقرأ: {إِنَّا فَتَحْنَا لَكَ فَتْحًا مُّبِينًا}. وعفا عن أهل مكة قائلًا: 'اذهبوا فأنتم الطلقاء'. كانت الغزوات دفاعًا لا اعتداءً، ورحمة لا انتقامًا.",
        "fact": "في غزوة بدر، دعا النبي ﷺ ربه: 'اللهم إن تهلك هذه العصابة اليوم لا تُعبد في الأرض'. فأنزل الله الملائكة تقاتل معهم: {إِذْ تَسْتَغِيثُونَ رَبَّكُمْ فَاسْتَجَابَ لَكُمْ أَنِّي مُمِدُّكُم بِأَلْفٍ مِّنَ الْمَلَائِكَةِ مُرْدِفِينَ}. قُتل من المشركين سبعون وأُسر سبعون، ولم يُقتل من المسلمين إلا أربعة عشر رجلًا."
    },
    "scene15": {
        "title": "خطبة الوداع",
        "year": "10 هـ",
        "paragraph": "في حجة الوداع، وقف النبي ﷺ على جبل عرفات أمام أكثر من مئة ألف مسلم، يُلقي خطبته الأخيرة. قال: 'أيها الناس، إن دماءكم وأموالكم وأعراضكم حرام عليكم كحرمة يومكم هذا في شهركم هذا في بلدكم هذا'. ثم قال: 'لا فضل لعربي على أعجمي ولا لأبيض على أسود إلا بالتقوى'. وقال: 'استوصوا بالنساء خيرًا'. ثم رفع إصبعه إلى السماء وقال: 'اللهم هل بلغت؟' فقالوا: نعم. فقال: 'اللهم فاشهد'. ثم نزلت الآية: {الْيَوْمَ أَكْمَلْتُ لَكُمْ دِينَكُمْ وَأَتْمَمْتُ عَلَيْكُمْ نِعْمَتِي وَرَضِيتُ لَكُمُ الْإِسْلَامَ دِينًا}. فبكى أبو بكر، لأنه فهم أن النبي سيموت قريبًا.",
        "fact": "في خطبة الوداع، ألغى النبي ﷺ كل عادات الجاهلية: الربا، والثأر، والتفاخر بالأنساب. وأعلن حقوق المرأة في زمن كانت فيه مهانة. وأكد على وحدة الأمة ومساواة البشر. كانت الخطبة دستورًا إنسانيًا متكاملًا."
    },
    "scene16": {
        "title": "الرحيل الأعظم",
        "year": "11 هـ",
        "paragraph": "في يوم الاثنين من شهر ربيع الأول، توفي النبي ﷺ في حجر عائشة رضي الله عنها. كان آخر ما قاله: 'الصلاة الصلاة وما ملكت أيمانكم'. ثم قال: 'اللهم الرفيق الأعلى'. فاضطربت المدينة، وأنكر عمر الخبر، وقال: 'من قال إن محمدًا مات قطعت رأسه'. فوقف أبو بكر بثبات الجبال وقال: 'من كان يعبد محمدًا فإن محمدًا قد مات، ومن كان يعبد الله فإن الله حي لا يموت'. ثم قرأ: {وَمَا محَمَّدٌ إِلَّا رَسُولٌ قَدْ خَلَتْ مِن قَبْلِهِ الرُّسُلُ ۚ أَفَإِن مَّاتَ أَوْ قُتِلَ انقَلَبْتُمْ عَلَىٰ أَعْقَابِكُمْ}. فثبت الناس، وبدأ عهد الخلافة الراشدة.",
        "fact": "قبل وفاته بأيام، خرج النبي ﷺ إلى البقيع واستغفر لأهله، ثم قال: 'إني خُيرت بين خزائن الدنيا والخلد فيها ثم الجنة، وبين لقاء ربي والجنة، فاخترت لقاء ربي'. كان يعلم أن أجله قد اقترب، لكنه كان راضيًا مطمئنًا."
    },
    "scene17": {
        "title": "الإسلام اليوم",
        "year": "العصر الحديث",
        "paragraph": "اليوم، يعتنق الإسلام أكثر من ملياري إنسان حول العالم. من إندونيسيا إلى المغرب، ومن نيجيريا إلى بريطانيا، ينتشر نور الإسلام في كل مكان. ما بدأ في غار صغير على يد رجل واحد، أصبح رسالة عالمية تُغير حياة الملايين. الناس يدخلون في دين الله أفواجًا، لأنهم يرون فيه العدل والرحمة والسلام. القرآن الذي نزل قبل أربعة عشر قرنًا لا يزال محفوظًا كما أنزله الله، لم يتغير منه حرف واحد. والإسلام اليوم هو الدين الأسرع انتشارًا في العالم، لأنه دين الفطرة، دين يُخاطب العقل والقلب معًا. يقول الله تعالى: {هُوَ الَّذِي أَرْسَلَ رَسُولَهُ بِالْهُدَىٰ وَدِينِ الْحَقِّ لِيُظْهِرَهُ عَلَى الدِّينِ كُلِّهِ وَلَوْ كَرِهَ الْمُشْرِكُونَ}. الرسالة مستمرة، والنور لا ينطفئ، لأن الله تعهد بحفظه: {يُرِيدُونَ لِيُطْفِئُوا نُورَ اللَّهِ بِأَفْوَاهِهِمْ وَاللَّهُ مُتِمُّ نُورِهِ وَلَوْ كَرِهَ الْكَافِرُونَ}.",
        "fact": "في السنوات الأخيرة، ازداد عدد المسلمين في أوروبا وأمريكا بشكل ملحوظ، خاصة بين المثقفين والعلماء. كثير منهم يقولون إنهم وجدوا في الإسلام إجابات على أسئلة حيرتهم طوال حياتهم. من أشهر من أسلم حديثًا: يوسف إسلام (كات ستيفنز) المغني البريطاني، ومحمد علي كلاي الملاكم الأمريكي، ود. جيفري لانج الأستاذ الجامعي الأمريكي الذي ألف كتاب 'حتى الملائكة تسأل'. هؤلاء وغيرهم كثير يُثبتون أن الإسلام رسالة عالمية خالدة، تُناسب كل زمان ومكان."
    }
}