{
    "scene1": {
        "title": "الجزيرة التي تنتظر ميلاد النور",
        "year": "قبل الهجرة بنحو 200 عام",
        "paragraph": "كانت الجزيرة العربية تعيش زمناً متقلّباً، تقف فيه على حافة السقوط رغم ما تمتلكه من القوة والموقع والثراء. السيوف تحكم أكثر مما تحكم العقول، والعصبية القبليّة كانت ميزان الحق عند أكثر الناس. يتغيّر الولاء بتغيّر الريح، ويعلو صوت الكبرياء فوق صوت العدالة. الضعفاء—وخاصة النساء واليتامى والعبيد—لا يجدون ملجأ ولا نصير، إلا ما يفيض من رحمة بعض القلوب. ومع كل هذا الاضطراب، كان الناس يبحثون عن معنى… يبحثون عن حقٍ ضائع وسط عادات متراكمة واعتقادات مشوّشة. كانت الأرض، بكل صراعاتها، تتهيأ دون أن تدري لحضور رسالة ستعيد للإنسان مكانته، وتجمع ما تفرّق، وتُعيد تعريف الحياة نفسها.",
        "fact": "بعض القبائل كانت ترى في البنات عبئًا اقتصاديًا واجتماعيًا، فيقدمون على وأدهن خوفًا من الفقر أو العار، وهو فعل يُجسّد مدى الانحدار الأخلاقي قبل أن يشرق نور الرسالة."
    },
    "scene2": {
        "title": "أرض تائهة تبحث عن معنى",
        "year": "قبل الهجرة بنحو 150 عام",
        "paragraph": "كانت الحياة الدينية أشبه بغابة من المعتقدات؛ الأصنام تحيط بالكعبة من كل جانب، ولكل قبيلة صنمها الذي ورثته دون سؤال أو يقين. امتلأ القلب الإنساني بالبحث، لكن الطقوس الخاطئة غطّت على الفطرة التي تحنّ للتوحيد. وسط هذا الضباب، برزت قلة قليلة من 'الحُنَفاء' الذين بقوا متمسكين بفكرة الإله الواحد، ينظرون لمن حولهم بدهشة وحزن، كأنهم ينتظرون شيئًا يعلمون أنه قادم. لم يكن الفراغ القيمي سببه الجهل فقط، بل غياب الحق الجامع الذي يربط بين الإنسان وربه. كانت الجزيرة، بمدنها وطرقها وأسواقها، تنتظر من يعيد إشعال المصباح الذي انطفأ منذ زمن.",
        "fact": "من الحنفاء الذين بقوا على التوحيد قبل الإسلام سيدنا ورقة بن نوفل، الذي رفض عبادة الأصنام وظل يبحث عن الدين الحق حتى لقي الله."
    },
    "scene3": {
        "title": "عام الفيل وبداية قصة النبي",
        "year": "قبل الهجرة بـ 53 سنة",
        "paragraph": "في عام اهتزّت فيه الجزيرة كلها حين تقدّم جيشٌ عظيم بقيادة أبرهة ليهدم الكعبة، شهدت مكة حدثًا لم ينسه العرب قط. لم يقف أمام ذلك الجيش سيفٌ ولا جيش، بل قدرة الله وحدها، حين هلكت الفيلة وجنودها بطريقة عجز البشر عن تفسيرها. وفي العام نفسه، وُلد الطفل الذي سيُغيّر مجرى التاريخ: محمد ﷺ. جاء إلى الدنيا يتيم الأب، بلا جاه ولا ثراء، لكن حياته من لحظاتها الأولى حملت إشارات القدر. نشأ محاطًا بالرحمة، متحمّلًا قسوة اليُتم، يرى الظلم والانقسام حوله، فتتشكل داخله شخصية صلبة ورحيمة في آن واحد… شخصية ستقود البشرية إلى طريق جديد.",
        "fact": "كان جيش أبرهة يضم فيلة ضخمة لم يعهدها العرب من قبل، وكان مجرد ظهورها عند أسوار مكة حدثًا مخيفًا، مما جعل نجاتها معجزة رسّخت قدسية البيت الحرام في قلوبهم."
    },
    "scene4": {
        "title": "راعٍ يتعلم الصبر وحده في الجبال",
        "year": "قبل الهجرة بنحو 45 سنة",
        "paragraph": "في سنوات شبابه، خرج النبي ﷺ إلى شعاب مكة راعيًا للغنم. كانت مهنة بسيطة في ظاهرها، لكنها مدرسة حقيقية في الصبر والانتباه والتواضع. في تلك الجبال الهادئة، تعلّم أن يتعامل مع الخوف، وأن يحمي الضعيف، وأن يراقب المخلوقات في صمت. كانت الطبيعة من حوله تفتح له أبوابًا للتفكير، وتُهيّئ قلبه ليكون أكثر رِقة وحكمة. كانت تلك المرحلة جزءًا من إعداد إلهي لا يراه الناس، لكنها كانت تربي راعيًا سيتحول يومًا ما إلى قائد أمة.",
        "fact": "ثبت عنه ﷺ قوله: «ما من نبي إلا وقد رعى الغنم»، ليؤكد أن هذه المهنة كانت تدريبًا إلهيًا للنفوس الكبيرة قبل أن تُكلّف بحمل الرسالات."
    },
    "scene5": {
        "title": "حياة تُبنى على الصدق قبل الرسالة",
        "year": "قبل الهجرة",
        "paragraph": "قبل أن يكون نبيًا، كان محمد ﷺ معروفًا بين أهل مكة بلقب الصادق الأمين. لم يتردد أحد في وضع أماناته عنده، ولم يُعرف عنه كذب أو خيانة. كان شابًا هادئًا، لكنه قوي الأخلاق… قليل الكلام، كثير الحكمة. إذا اختلفت القبائل على أمر، لجأوا إليه. وإذا ضاقت صدور الناس بالنزاعات، وجدوا فيه ملاذًا آمنًا. كانت سمعته تلك جزءًا من البناء التدريجي لشخصيته، حتى إذا نزل الوحي، عرف الناس أنه ليس رجلًا عاديًا.",
        "fact": "توسّعت دائرة الثقة به ﷺ بسبب وساطاته العادلة بين القبائل، حتى أن من عارضوه بعد البعثة كانوا لا يزالون يتركون عنده ودائعهم."
    },
    "scene6": {
        "title": "في غار حراء",
        "year": "قبل الهجرة بـ 18 سنة",
        "paragraph": "كان غار حراء مكانًا صغيرًا، لكنه كان عالمًا واسعًا بالنسبة للنبي ﷺ. كان يصعد إليه بعيدًا عن أصوات الأسواق وصراعات القبائل. يجلس في عزلته، يتأمل السماء، وينظر إلى مكة من بعيد، كأنه يبحث عن الحقيقة في صمت لا يسمعه إلا الله. في ذلك الغار، نما قلبه على معنى التفكّر. كان المكان شديد الوعورة، لكن صفاءه كان يفتح أبوابًا من النور. كأن الله يهيّئ روح النبي لحمل الرسالة الأعظم في التاريخ.",
        "fact": "يقع الغار في جبل النور، وصعوده اليوم يُظهر كم كانت خلوته شاقة، مما يكشف عن قوة إرادته ورغبته العميقة في التأمل."
    },
    "scene7": {
        "title": "بداية الوحي… لحظة تغيّر العالم",
        "year": "قبل الهجرة بـ 13 سنة",
        "paragraph": "في ليلة من الليالي، وبينما كان النبي ﷺ في غار حراء، جاءه سيدنا جبريل عليه السلام يحمل أول آية من القرآن: «اقرأ». كانت لحظة عظيمة تهتزّ لها الجبال لو خوطبت بها. شعر النبي بالخوف من عِظم ما رأى، لا من الشك، فعاد مسرعًا إلى بيته يرجف، فكانت السيدة خديجة رضي الله عنها أول من احتضن قلبه وطمأنه. ومن تلك اللحظة، بدأ نور الرسالة ينتشر… نور سيغيّر الأرض ويعيد تعريف الإنسان.",
        "fact": "ذهب النبي بعدها إلى سيدنا ورقة بن نوفل، فقال له إن الذي جاءه هو سيدنا جبريل عليه السلام، وأنه نبي هذه الأمة."
    },
    "scene8": {
        "title": "الدعوة التي بدأت من البيوت لا من القصور",
        "year": "قبل الهجرة بـ 12 سنة",
        "paragraph": "انتشرت الدعوة الإسلامية في بدايتها سرًا، من قلب مؤمن إلى قلب آخر. لم تُبْنَ على قوة سيف، بل على قوة صدق. اجتمع المسلمون الأوائل في البيوت، يصلّون خفية، ويتعلّمون القرآن، ويتحملون الأذى في صمت مؤمن. كانت تلك المرحلة اختبارًا شديدًا للقلوب، لكنها كشفت عن معدن الرجال والنساء الذين سيصنعون تاريخًا جديدًا.",
        "fact": "كان بعض المسلمين يهربون إلى الكهوف أو الأماكن الخفية خوفًا من بطش قريش، ومع ذلك لم يتراجعوا عن إيمانهم."
    },
    "scene9": {
        "title": "رحلة الإسراء والمعراج… تكريم سماوي لنبي الأرض",
        "year": "قبل الهجرة بـ 10 سنوات",
        "paragraph": "في ليلة واحدة، أُسري بالنبي ﷺ من مكة إلى القدس، ثم عُرج به إلى السماوات العُلا. لم تكن الرحلة مجرد معجزة، بل تكريم إلهي لنبي بلغ أقصى درجات الصبر. رأى فيها من آيات الله ما لم يره بشر، والتقى بسيدنا موسى وسيدنا إبراهيم وغيرهما من الأنبياء. كانت الرحلة رسالة واضحة: أن ما يحدث في الأرض مرتبط بعوالم أعلى، وأن النبي ﷺ ليس قائدًا أرضيًا فقط، بل رسول من السماء.",
        "fact": "استقبال الأنبياء للنبي ﷺ في السماوات كان إعلانًا بوحدة الرسالات وأن محمدًا ﷺ خاتمهم جميعًا."
    },
    "scene10": {
        "title": "عام الحزن… حين يشتد الليل قبل الفجر",
        "year": "قبل الهجرة بـ 8 سنوات",
        "paragraph": "فقد النبي ﷺ في عام واحد زوجته السيدة خديجة رضي الله عنها، التي كانت سنده الأول، وفقد كذلك عمّه سيدنا أبو طالب الذي كان يحميه من أذى قريش. كان عامًا ثقيلًا على قلبه، لكن رغم الحزن لم تتوقف دعوته لحظة واحدة. كان العام دليلًا على أن حتى أعظم البشر يمرون بابتلاءات، وأن الطريق إلى النور لا يخلو من الألم.",
        "fact": "كان سيدنا أبو طالب رغم عدم إسلامه يحمي النبي حماية سياسية كاملة، ووفاته كشفت للنبي حجم العداء الذي ينتظره بعد سقوط هذا السند."
    },
    "scene11": {
        "title": "الاضطهاد في مكة… صبر يبني أمة",
        "year": "قبل الهجرة",
        "paragraph": "اشتد أذى قريش كلما زادت الدعوة انتشارًا. هزؤوا به، ضايقوه، واعتدوا على من اتبعه. سُجن البعض، وجُلد البعض، وقُتل آخرون. ومع ذلك لم يردّ النبي ﷺ بعنف، بل واجه كل ذلك بالرحمة والثبات. كانت تلك المرحلة برهانًا على أن الإسلام لم ينتشر بقوة السلاح، بل بقوة الصمود أمام الظلم.",
        "fact": "فرضت قريش حصارًا اقتصاديًا على المسلمين في شعب أبي طالب لمدة ثلاث سنوات، حتى أكل الناس أوراق الشجر من شدة الجوع."
    },
    "scene12": {
        "title": "الجهر بالدعوة… كلمة حق تهز مدينة",
        "year": "قبل الهجرة بـ 12 سنة إلى قبل الهجرة بسنة",
        "paragraph": "حين أمره الله بالجهر بالدعوة، وقف النبي ﷺ أمام أهل مكة يعلن ما يؤمن به دون خوف. كانت كلماته تُقلق زعماء قريش، لأن نور الحق يزعج من يتخذ الظلم طريقًا. فاشتد العداء، وبدأت المؤامرات لإسكاته وإيذائه، وحتى قتله. ومع ذلك، لم يتراجع… بل ظل ثابتًا، يذكّرهم بالقيم قبل أن يذكّرهم بالعقاب.",
        "fact": "اجتمع كبار قريش أكثر من مرة للتخطيط لقتله، لكن كل محاولة فشلت لأن الله كان يحفظ رسوله."
    },
    "scene13": {
        "title": "الهجرة… بداية أمة جديدة",
        "year": "عام الهجرة",
        "paragraph": "عندما بلغ الأذى ذروته، أذن الله للمسلمين بالهجرة. خرج النبي ﷺ ليلًا مع صاحبه سيدنا أبو بكر الصديق رضي الله عنه، تاركًا مكة التي أحبها. كانت الرحلة مليئة بالخطر، من مطاردة القوم إلى اختباء الغار، لكن الله كان معهما. كانت الهجرة انتقالًا من مرحلة الضعف إلى بناء مجتمع جديد، له قيمه وقوانينه وقلوبه المؤمنة.",
        "fact": "اتخذ المسلمون الهجرة بداية لتقويم جديد (1 هـ) لأنها كانت نقطة التحوّل في تاريخ الإسلام كله."
    },
    "scene14": {
        "title": "الغزوات… دفاع لا اعتداء",
        "year": "2–8 هـ",
        "paragraph": "بعد الهجرة، اشتدت حاجة المسلمين للدفاع عن أنفسهم. لم تكن الغزوات رغبة في التوسع، بل حماية للمدينة من هجمات متواصلة. ورغم الحروب، كان النبي ﷺ يوصي دائمًا بالرحمة: لا تُقتل امرأة، ولا طفل، ولا تُقطع شجرة بلا سبب. كانت الغزوات مدرسة في الأخلاق قبل أن تكون معارك.",
        "fact": "في غزوة بدر، كان المسلمون قلة قليلة وعددهم أقل من ثلث جيش قريش، لكن الإيمان والثبات وحُسن التخطيط منحهم أول انتصار كبير."
    },
    "scene15": {
        "title": "خطبة الوداع… وصايا قائدٍ يعرف قرب رحيله",
        "year": "10 هـ",
        "paragraph": "وقف النبي ﷺ أمام أكثر من مئة ألف مسلم، يُلقي خطبة الوداع. جمع فيها خلاصة الرسالة: حرمة الدماء، المساواة، حقوق النساء، الأمانة، وتحمّل المسؤولية. لم تكن كلمات قائد سياسي، بل كلمات أبٍ يوصي أمته قبل أن يغادر الدنيا. كانت الخطبة إعلانًا بأن الرسالة اكتملت، وأن الأمة أصبحت جاهزة لتحمل الأمانة.",
        "fact": "نصّت الخطبة على أنه لا فضل لعربي على أعجمي إلا بالتقوى، في وقت كانت فيه العصبيات جزءًا من تركيب المجتمع."
    },
    "scene16": {
        "title": "بعد الرحيل… يوم ثقيل على القلوب",
        "year": "11 هـ",
        "paragraph": "يوم وفاة النبي ﷺ كان من أثقل الأيام على المسلمين. نزل الحزن على المدينة كظلّ ثقيل، حتى إن سيدنا عمر بن الخطاب رضي الله عنه لم يصدق الخبر في البداية. لكن سيدنا أبو بكر الصديق رضي الله عنه وقف بثبات يُشبه ثبات الجبال، ليقول كلمته الخالدة: 'من كان يعبد محمدًا فإن محمدًا قد مات، ومن كان يعبد الله فإن الله حيّ لا يموت.' بهذا الموقف، بدأ المسلمون عهدًا جديدًا، يحملون فيه الرسالة بعقولهم وقلوبهم.",
        "fact": "اختيار سيدنا أبي بكر للخلافة فورًا حفظ الأمة من الانقسام في لحظة كانت الأخطر منذ تأسيس الدولة."
    },
    "scene17": {
        "title": "الإسلام اليوم… من غار صغير إلى قارات العالم",
        "year": "العصر الحديث",
        "paragraph": "اليوم، يصل نور الإسلام إلى ربع سكان العالم. من القاهرة إلى جاكرتا، ومن داكار إلى لندن، يعتنق الناس هذا الدين لأنهم يرون أثره في السلوك قبل الكلام. ما بدأ في غار حراء على يد رجل واحد أصبح رسالة عالمية تنير القلوب وتحرّك الضمائر. إنها رحلة ممتدة… لم تنتهِ، ولن تنتهي، لأنها رسالة تبحث عنها كل روح تشتاق للمعنى.",
        "fact": "الإسلام اليوم هو ثاني أكبر ديانة في العالم، وينتشر خصوصًا في إفريقيا وآسيا بسرعة لافتة بسبب وضوح مبادئه وعدالته وروحه الإنسانية."
    }
}