[
    {
        "number": 4,
        "narrator": "Abdullah ibn Masood",
        "text": "Verily the creation of each one of you is brought together in his mother's womb for forty days in the form of a nutfah (a drop), then he becomes an alaqah (clot of blood) for a like period, then a mudghah (morsel of flesh) for a like period, then there is sent to him the angel who blows his soul into him and who is commanded with four matters: to write down his rizq (sustenance), his life span, his actions, and whether he will be happy or unhappy (i.e., whether or not he will enter Paradise). By the One, other than Whom there is no deity, verily one of you performs the actions of the people of Paradise until there is but an arms length between him and it, and that which has been written overtakes him, and so he acts with the actions of the people of the Hellfire and thus enters it; and verily one of you performs the actions of the people of the Hellfire, until there is but an arms length between him and it, and that which has been written overtakes him and so he acts with the actions of the people of Paradise and thus he enters it.",
        "source": "Bukhari & Muslim",
        "clarification": "This hadith describes human development stages and confirms qadar (predestination). After four months, an angel records four aspects: provision, life span, deeds, and final outcome. The final condition is predestined as a consequence of deeds. One should not submit passively to supposed fate but make every effort for good, as Allah holds us responsible. Deeds are judged by how they are sealed - one's final actions reveal the reality of their intention."
    },
    {
        "number": 7,
        "narrator": "Tameem ibn Aus ad-Daree",
        "text": "The deen (religion) is naseehah (advice, sincerity).",
        "source": "Muslim",
        "clarification": "Sincerity (naseehah) is the larger or most important part of religion. It includes: sincerity to Allah (belief, obedience, gratitude), to His Book (belief in Quran, reciting it correctly, understanding it), to His Messenger (obedience, love, adherence to sunnah), to Muslim leaders (aiding them in righteousness, advising them), and to Muslim people (guiding them, helping them, being compassionate). Sincere advice is a collective duty when one has knowledge and influence."
    },
    {
        "number": 13,
        "narrator": "Anas bin Malik",
        "text": "None of you [truly] believes until he loves for his brother that which he loves for himself.",
        "source": "Bukhari & Muslim",
        "clarification": "Perfection of iman requires consideration for others and desiring good for them: guidance to Islam, virtuous conduct, and lawful worldly things. This includes disliking for them what you dislike for yourself. Such a believer helps others, shares wealth, passes on knowledge, and gives time for their benefit. True believers are as one soul, preferring their brothers to themselves, which opposes the soul's natural selfishness."
    },
    {
        "number": 14,
        "narrator": "Ibn Masood",
        "text": "It is not permissible to spill the blood of a Muslim except in three [instances]: the married person who commits adultery, a life for a life, and the one who forsakes his religion and separates from the community.",
        "source": "Bukhari & Muslim",
        "clarification": "The sanctity of Muslim life is confirmed. Three exceptions allow legal execution by the state to protect society: 1) Married adulterer (after strict proof requirements), 2) Murder (retribution, though payment may be accepted instead), 3) Apostasy (public defiant reversion from Islam after being given time to reconsider). The death penalty may only be carried out after conviction free of doubt and with strict conditions met."
    },
    {
        "number": 16,
        "narrator": "Abu Hurayrah",
        "text": "Do not become angry.",
        "source": "Al-Bukhari",
        "clarification": "What is meant is not to act upon anger. While anger is a natural reaction, one can train themselves to react wisely. Anger comprises all evil and is from Shaytan. Remedies include: performing ablution, saying 'A'udhu billahi min ash-Shaytanir-rajeem', changing position (sitting or lying down to distance from confrontation), and controlling oneself. The strong person is one who controls themselves when angry, not one who overpowers others."
    },
    {
        "number": 17,
        "narrator": "Abu Ya'la Shaddad bin Aws",
        "text": "Verily Allah has prescribed ihsan (proficiency, perfection) in all things. So if you kill then kill well; and if you slaughter, then slaughter well. Let each one of you sharpen his blade and let him spare suffering to the animal he slaughters.",
        "source": "Muslim",
        "clarification": "Allah has made ihsan (doing something well) a duty toward all things and creatures. Good treatment is ordained toward any person or animal to be killed lawfully - making death swift and easy, sparing unnecessary pain. For slaughter: lead gently, offer water, sharpen knife beforehand, conceal it from the animal, don't slaughter in presence of other animals, turn toward qiblah, mention Allah's name, cut deeply with one stroke, then let it drain."
    },
    {
        "number": 18,
        "narrator": "Abu Dharr Jundub ibn Junadah & Muadh bin Jabal",
        "text": "Have taqwa (fear) of Allah wherever you may be, and follow up a bad deed with a good deed which will wipe it out, and behave well towards the people.",
        "source": "At-Tirmidhi",
        "clarification": "This comprehensive instruction covers Allah's rights and people's rights. Fear Allah at every time and place by obeying conscientiously, remembering He sees everything. Eliminate misdeeds by following them with good deeds, primarily repentance. Good deeds like ablution, prayer, hajj, and fasting serve as expiation for lesser sins (major sins require complete repentance). Behaving well toward people is essential for complete taqwa."
    },
    {
        "number": 19,
        "narrator": "Abdullah bin Abbas",
        "text": "Be mindful of Allah and Allah will protect you. Be mindful of Allah and you will find Him in front of you. If you ask, then ask Allah [alone]; and if you seek help, then seek help from Allah [alone]. And know that if the nation were to gather together to benefit you with anything, they would not benefit you except with what Allah had already prescribed for you. And if they were to gather together to harm you with anything, they would not harm you except with what Allah had already prescribed against you. The pens have been lifted and the pages have dried.",
        "source": "At-Tirmidhi",
        "clarification": "Keeping Allah in mind means obeying His commands and maintaining His rights. Result: Allah protects your faith and keeps you on the straight path. Establish a good relationship with Allah in ease, and He'll aid you in hardship. Ask and seek help from Allah alone as the sole source of benefit and harm. Everything is predestined, giving comfort in distress. Accept Allah's decree graciously, showing true submission and trust. Relief will come as Allah promised."
    },
    {
        "number": 20,
        "narrator": "Abu Masood Uqbah bin 'Amr al-Ansaree al-Badree",
        "text": "Verily, from what was learnt by the people from the speech of the earliest prophecy is: If you feel no shame, then do as you wish.",
        "source": "Al-Bukhari",
        "clarification": "This ancient virtue (al-haya' - shyness/modesty) affects behavior in public and private. It can be inborn or acquired through knowledge of Allah. Shyness from Allah prevents deeds that appear ugly in His sight and prompts immediate repentance. Interpretations: 1) One without shame will do whatever they please, 2) If an action won't cause embarrassment before Allah, proceed, 3) A threat - if you feel no shame, do as you will and Allah will punish you."
    },
    {
        "number": 22,
        "narrator": "Abu Abdullah Jabir bin Abdullah al-Ansaree",
        "text": "Do you think that if I perform the obligatory prayers, fast in Ramadhan, treat as lawful that which is halal, and treat as forbidden that which is haram, and do not increase upon that [in voluntary good deeds], then I shall enter Paradise?",
        "source": "Muslim",
        "clarification": "The Prophet clarified the difference between obligatory and voluntary deeds. While the man's obligations are sufficient for Paradise, the Prophet didn't want to discourage a new Muslim. True believers don't limit themselves to obligations but exert efforts in additional worship. Supererogatory worship makes up for deficiencies in obligatory deeds, and deliberately avoiding the Prophet's sunnah is sinful. The hadith may reflect an allowance for a temporary circumstance or be comprehensive if one avoids all haram."
    },
    {
        "number": 25,
        "narrator": "Abu Dharr",
        "text": "Some people from amongst the Companions of the Messenger of Allah (peace and blessings of Allah be upon him) said to the Prophet (peace and blessings of Allah be upon him), \"O Messenger of Allah, the affluent have made off with the rewards; they pray as we pray, they fast as we fast, and they give [much] in charity by virtue of their wealth.\"",
        "source": "Muslim",
        "clarification": "The Prophet directed poorer companions to other rewarding deeds not requiring wealth. He redefined sadaqah comprehensively: every good deed is charity, including remembrance of Allah (subhan Allah, Allahu akbar, al-hamdulillah, la ilaha ill-Allah), enjoining right, forbidding wrong, and even lawful marital relations when intended to satisfy oneself and spouse lawfully or seek righteous children. With proper intention, any permissible act becomes worship, making the Muslim a worshipper throughout life."
    },
    {
        "number": 26,
        "narrator": "Abu Hurayrah",
        "text": "Every joint of a person must perform a charity each day that the sun rises: to judge justly between two people is a charity. To help a man with his mount, lifting him onto it or hoisting up his belongings onto it, is a charity. And the good word is a charity. And every step that you take towards the prayer is a charity, and removing a harmful object from the road is a charity.",
        "source": "Bukhari & Muslim",
        "clarification": "The Prophet emphasizes daily gratitude for the blessing of the body's joints. Upon the body is a form of zakah - the performance of righteous deeds. All kinds of good deeds are charities: justice, assistance, kind words, walking to prayer, and removing harm from the road."
    },
    {
        "number": 27,
        "narrator": "An-Nawas bin Sam'an",
        "text": "Righteousness is in good character, and wrongdoing is that which wavers in your soul, and which you dislike people finding out about.",
        "source": "Muslim",
        "clarification": "Righteousness (birr) is good character and obedience to Allah. Wrongdoing creates uneasiness in the heart and soul. The believer's heart, illuminated by faith, can discern truth from falsehood even without a formal legal ruling, especially when such rulings lack evidence or sincerity."
    },
    {
        "number": 29,
        "narrator": "Muadh bin Jabal",
        "text": "You have asked me about a great matter, yet it is easy for him for whom Allah makes it easy: worship Allah, without associating any partners with Him; establish the prayer; pay the zakat; fast in Ramadhan; and make the pilgrimage to the House.",
        "source": "At-Tirmidhi",
        "clarification": "This comprehensive hadith outlines the path to Paradise. It reiterates the pillars of Islam and highlights voluntary deeds: fasting as a shield, charity extinguishing sin, and night prayer. It identifies Islam as the head, prayer as the pillar, and Jihad as the peak. Finally, it emphasizes controlling the tongue as the foundation of all goodness, warning that speech is a primary cause for entering Hell."
    },
    {
        "number": 31,
        "narrator": "Abu al-'Abbas Sahl bin Sa'ad as-Sa'idee",
        "text": "Renounce the world and Allah will love you, and renounce what the people possess and the people will love you.",
        "source": "Ibn Majah",
        "clarification": "The Prophet advises zuhd (indifference/detachment) towards worldly pleasures to gain Allah's love, and towards people's possessions to gain their love. True zuhd isn't poverty, but trusting Allah more than one's possessions and not letting worldly loss or gain affect one's faith. It means using worldly means for the Hereafter without being attached to them."
    },
    {
        "number": 32,
        "narrator": "Abu Sa'eed al-Khudree",
        "text": "There should be neither harming (darar) nor reciprocating harm (dirar).",
        "source": "Ibn Majah & Ad-Daraqutnee",
        "clarification": "This fundamental legal maxim prohibits all forms of harm and the reciprocation of harm with injustice. One must avoid harming others and, if harmed, seek legal redress or forgive rather than retaliate with greater harm. It covers physical, financial, and emotional injury."
    },
    {
        "number": 33,
        "narrator": "Ibn Abbas",
        "text": "Were people to be given everything that they claimed, men would [unjustly] claim the wealth and lives of [other] people. But, the onus of proof is upon the claimant, and the taking of an oath is upon him who denies.",
        "source": "Al-Baihaqee",
        "clarification": "This hadith establishes a core legal principle: the burden of proof lies with the claimant (plaintiff), while the oath is required from the defendant who denies the claim. This protects people's property and rights from baseless accusations. If proof is lacking, the defendant's oath settles the matter, with severe consequences in the Hereafter for false oaths."
    },
    {
        "number": 35,
        "narrator": "Abu Hurayrah",
        "text": "Do not envy one another, and do not inflate prices for one another, and do not hate one another, and do not turn away from one another, and do not undercut one another in trade, but [rather] be slaves of Allah and brothers [amongst yourselves]. A Muslim is the brother of a Muslim: he does not oppress him, nor does he fail him, nor does he lie to him, nor does he hold him in contempt. Taqwa (piety) is right here [and he pointed to his chest three times]. It is evil enough for a man to hold his brother Muslim in contempt. The whole of a Muslim is inviolable for another Muslim: his blood, his property, and his honour.",
        "source": "Muslim",
        "clarification": "The Prophet commands brotherhood by prohibiting envy, deception in trade, hatred, boycotting, and intruding on transactions. He defines the rights of a Muslim: protection from oppression, abandonment, lying, and contempt. He emphasizes that true piety (taqwa) is in the heart, and violating a Muslim's life, property, or honor is strictly forbidden."
    },
    {
        "number": 36,
        "narrator": "Abu Hurayrah",
        "text": "Whoever removes a worldly grief from a believer, Allah will remove from him one of the griefs of the Day of Resurrection. And whoever alleviates the need of a needy person, Allah will alleviate his needs in this world and the Hereafter. Whoever shields [or hides the misdeeds of] a Muslim, Allah will shield him in this world and the Hereafter. And Allah will aid His slave so long as he aids his brother. And whoever follows a path to seek knowledge therein, Allah will make easy for him a path to Paradise. No people gather together in one of the Houses of Allah, reciting the Book of Allah and studying it among themselves, except that sakeenah (tranquility) descends upon them, and mercy envelops them, and the angels surround them, and Allah mentions them amongst those who are with Him. And whoever is slowed down by his actions, will not be hastened forward by his lineage.",
        "source": "Muslim",
        "clarification": "This hadith encourages helping others. Relieving a believer's distress, making things easy for the indebted, and concealing faults brings similar rewards from Allah in this life and the Hereafter. It promises Allah's aid to those who aid others, facilitates the path to Paradise for seekers of knowledge, and describes the blessings (tranquility, mercy) upon those who gather to study the Quran."
    },
    {
        "number": 37,
        "narrator": "Ibn Abbas",
        "text": "Verily Allah ta'ala has written down the good deeds and the evil deeds, and then explained it [by saying]: \"Whosoever intended to perform a good deed, but did not do it, then Allah writes it down with Himself as a complete good deed. And if he intended to perform it and then did perform it, then Allah writes it down with Himself as from ten good deeds up to seven hundred times, up to many times multiplied. And if he intended to perform an evil deed, but did not do it, then Allah writes it down with Himself as a complete good deed. And if he intended it [i.e., the evil deed] and then performed it, then Allah writes it down as one evil deed.\"",
        "source": "Bukhari & Muslim",
        "clarification": "This hadith qudsi reveals Allah's immense mercy. Good intentions are rewarded as a full good deed, and if acted upon, multiplied ten to seven hundred times or more. Bad intentions abandoned for Allah's sake earn a good deed; if committed, they are recorded as only one sin. It highlights that Allah's generosity vastly outweighs His strict justice."
    },
    {
        "number": 38,
        "narrator": "Abu Hurayrah",
        "text": "Whosoever shows enmity to a wali (friend) of Mine, then I have declared war against him. And My servant does not draw near to Me with anything more loved to Me than the religious duties I have obligated upon him. And My servant continues to draw near to me with nafil (supererogatory) deeds until I Love him. When I Love him, I am his hearing with which he hears, and his sight with which he sees, and his hand with which he strikes, and his foot with which he walks. Were he to ask [something] of Me, I would surely give it to him; and were he to seek refuge with Me, I would surely grant him refuge.",
        "source": "Al-Bukhari",
        "clarification": "This hadith qudsi highlights the status of Allah's awliya (friends/allies). Enmity towards them is war against Allah. It establishes that the most beloved deeds are obligatory duties, followed by voluntary deeds which lead to Allah's special love and protection (He becomes their hearing, sight, etc. - meaning He guides their faculties). Allah grants their prayers and protects them."
    },
    {
        "number": 40,
        "narrator": "Abdullah ibn Umar",
        "text": "Be in this world as though you were a stranger or a wayfarer.",
        "source": "Al-Bukhari",
        "clarification": "This hadith enjoins detachment from the world. One should live as a stranger (longing for home) or a traveler (taking only what's necessary), not as a permanent resident. It encourages preparing for the Hereafter, using health and life before illness and death, and not delaying good deeds."
    }
]